<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"45a9d16162bbe7fd4e1bce6bd03f192b273b3e44a095a18ad0079b30cb6bb202","plan_job_ref":"Job Create terraform plan #33 at https://github.com/presentium/infrastructure/actions/runs/10291215593","plan_out_hash":"4d8fe6c4580ba8af09d77a9a0508cd7379fd44c052a72e4b4b84381bfca0d115","plan_hash":"07d6dd29898f7afad09781d5473fcbb4d06781c8b647c6a3fddf776068f98890","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 3 to add, 0 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.argocd.null_resource.argocd_apply_once is tainted, so must be replaced
-/+ resource "null_resource" "argocd_apply_once" {
!~      id       = "*******************" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # module.eks.module.eks.aws_eks_access_entry.this["cicd"] will be destroyed
  # (because key ["cicd"] is not in for_each map)
-   resource "aws_eks_access_entry" "this" {
-       access_entry_arn  = "arn:aws:eks:eu-west-1:123247571664:access-entry/presentium/role/123247571664/cicd/00c896e9-9640-0db8-8693-c179cafa038c" -> null
-       cluster_name      = "presentium" -> null
-       created_at        = "2024-08-07T17:11:40Z" -> null
-       id                = "presentium:arn:aws:iam::123247571664:role/cicd" -> null
-       kubernetes_groups = [] -> null
-       modified_at       = "2024-08-07T17:11:40Z" -> null
-       principal_arn     = "arn:aws:iam::123247571664:role/cicd" -> null
-       tags              = {
-           "karpenter.sh/discovery" = "presentium"
        } -> null
-       tags_all          = {
-           "Terraform"              = "true"
-           "karpenter.sh/discovery" = "presentium"
        } -> null
-       type              = "STANDARD" -> null
-       user_name         = "arn:aws:sts::123247571664:assumed-role/cicd/{{SessionName}}" -> null
    }

  # module.eks.module.eks.aws_eks_access_entry.this["cluster_creator"] will be created
+   resource "aws_eks_access_entry" "this" {
+       access_entry_arn  = (known after apply)
+       cluster_name      = "presentium"
+       created_at        = (known after apply)
+       id                = (known after apply)
+       kubernetes_groups = (known after apply)
+       modified_at       = (known after apply)
+       principal_arn     = "arn:aws:iam::123247571664:role/cicd"
+       tags              = {
+           "karpenter.sh/discovery" = "presentium"
        }
+       tags_all          = {
+           "Terraform"              = "true"
+           "karpenter.sh/discovery" = "presentium"
        }
+       type              = "STANDARD"
+       user_name         = (known after apply)
    }

  # module.eks.module.eks.aws_eks_access_policy_association.this["cicd_edit"] will be destroyed
  # (because key ["cicd_edit"] is not in for_each map)
-   resource "aws_eks_access_policy_association" "this" {
-       associated_at = "2024-08-07 17:11:41.024 +0000 UTC" -> null
-       cluster_name  = "presentium" -> null
-       id            = "presentium#arn:aws:iam::123247571664:role/cicd#arn:aws:eks::aws:cluster-access-policy/AmazonEKSEditPolicy" -> null
-       modified_at   = "2024-08-07 17:11:41.024 +0000 UTC" -> null
-       policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSEditPolicy" -> null
-       principal_arn = "arn:aws:iam::123247571664:role/cicd" -> null

-       access_scope {
-           type = "cluster" -> null
        }
    }

  # module.eks.module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
+   resource "aws_eks_access_policy_association" "this" {
+       associated_at = (known after apply)
+       cluster_name  = "presentium"
+       id            = (known after apply)
+       modified_at   = (known after apply)
+       policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
+       principal_arn = "arn:aws:iam::123247571664:role/cicd"

+       access_scope {
+           type = "cluster"
        }
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```
</details>

:x: Error applying plan in [Apply terraform plan #14](https://github.com/presentium/infrastructure/actions/runs/10291239279)